#include <assert.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <dolphin.h>

#include "global.h"
#include "background.h"
#include "ball.h"
#include "camera.h"
#include "effect.h"
#include "event.h"
#include "gxutil.h"
#include "input.h"
#include "light.h"
#include "mathutil.h"
#include "mode.h"
#include "ord_tbl.h"
#include "rend_efc.h"
#include "sound.h"
#include "sprite.h"
#include "stage.h"
#include "textbox.h"

struct SomeBigEndingStruct_sub2_sub
{
    u8 filler0[0x38];
    u16 unk38;
    u16 unk3A;
};

struct SomeBigEndingStruct_sub2
{
    struct SomeBigEndingStruct_sub2_sub *unk0;
    u8 filler4[0x10-0x4];
    u32 unk10;
    u32 unk14;
    u16 filler18;
    u8 filler1A[0x9C-0x1A];
    u32 unk9C;
    u8 fillerA0[0xB4-0xA0];
    u32 unkB4;
};

struct SomeBigEndingStruct_sub3
{
    struct SomeBigEndingStruct_sub2 *unk0;  // -0x57fc
    u16 unk4;
    u16 unk6;
    /*0x08*/ u8 fillerA808[2];
    /*0x0A*/ u16 unkA;
    /*0x0C*/ Vec unkC;
    /*0x18*/ Vec unk18;
             u8 filler24[0x30-0x24];
             s16 unk30;
             s16 unk32;
             s16 unk34;
             u16 unk36;
    /*0x38*/ s16 unk38;
    /*0x3A*/ s16 unk3A;
    /*0x3C*/ u8 fillerA83E[0x56-0x3C];
    s16 unk56;
    s16 unk58;
    s16 unk5A;
    s16 unk5C;
    u8 filler5E[0x70-0x5E];
    /*0x70*/ u32 unk70;  // -0x578c
    Vec unk74;
};  // size = 0x80

static_assert(offsetof(struct SomeBigEndingStruct_sub3, unk38) == 0x38, moo);

struct SomeBigEndingStruct_sub
{
    u16 unk0;
    u16 unk2;
    Vec unk4;
    Vec unk10;
    s16 unk1C;
    s16 unk1E;
    Vec unk20;
    Vec unk2C;
    Vec unk38;
    s16 unk44;
    u16 unk46;
    Vec unk48;
};  // size = 0x54

struct SomeBigEndingStruct
{
    float unk0;
    u8 filler4[0xA804-0x4];
    struct SomeBigEndingStruct_sub3 unkA804[4];
    u8 fillerAA04[0xAA0C-0xAA04];
    Vec unkAA0C;
    u8 fillerAA18[0xAA54-0xAA18];
    struct SomeBigEndingStruct_sub unkAA54;
    float unkAAA8;
    float unkAAAC;
    s32 unkAAB0;
    char *unkAAB4[2];
    u8 fillerAABC[0xAACC-0xAABC];
    u32 unkAACC;
    s32 unkAAD0;
};

static_assert(offsetof(struct SomeBigEndingStruct, unkAA54) == 0xAA54, bad);
static_assert(offsetof(struct SomeBigEndingStruct, unkAAB0) == 0xAAB0, bad);

struct
{
    s16 unk0;
    s16 unk2;
    u32 unk4;
